Revit 2027 API
BuiltInFailures.RebarShapeFailures.CurvesCollinear Property
 Collinear segments are not allowed in a Rebar Shape definition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CurvesCollinear { get; }
Public Shared ReadOnly Property CurvesCollinear As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CurvesCollinear {
	FailureDefinitionId^ get ();
}
static member CurvesCollinear : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarShapeFailures Class
Autodesk.Revit.DB Namespace